# Введение в функции в программировании

## Что такое функция?

Функция — это часть программы, которая выполняет определённую задачу. Представь, что функция — это как рецепт на кухне. Мы передаём ей ингредиенты (входные данные), а она делает что-то с ними и возвращает результат.

### Пример:
Представь, что ты хочешь узнать площадь прямоугольника. Чтобы вычислить площадь, нужно умножить длину на ширину. Мы можем написать функцию, которая будет делать это за нас.

### Функция в программировании:

- **Входные данные (параметры)** — это то, что мы передаём функции для обработки.
- **Выходные данные (возвращаемое значение)** — это результат, который функция выдаёт после выполнения.

### Зачем нужны функции?

1. **Упрощение кода** — если одна и та же задача выполняется много раз, мы можем вынести её в функцию и просто вызывать её, вместо того чтобы писать код каждый раз заново.
2. **Читаемость и понятность** — код становится более организованным и легче читаемым.
3. **Повторное использование** — одна и та же функция может использоваться в разных частях программы.

---

## Как создать функцию

### Синтаксис функции

В языке программирования C++ функция создаётся с помощью следующего синтаксиса:

```cpp
Тип_возвращаемого_значения имя_функции(параметры) {
    // Тело функции
    // Здесь выполняется какая-то задача
    return значение;
}
```

- **Тип_возвращаемого_значения** — тип данных, который функция вернёт (например, `int`, `float`, `void` — если ничего не возвращает).
- **имя_функции** — уникальное имя функции, по которому мы будем её вызывать.
- **параметры** — это данные, которые мы передаём функции для обработки.
- **return** — команда, которая возвращает результат из функции.

### Пример:

```cpp
#include <iostream>
using namespace std;

// Функция для вычисления площади прямоугольника
int calculateArea(int length, int width) {
    return length * width;
}

int main() {
    int length = 5;
    int width = 10;
    int area = calculateArea(length, width); // Вызов функции
    cout << "Площадь прямоугольника: " << area << endl;
    return 0;
}
```

**Объяснение кода:**

- Функция `calculateArea` принимает два параметра: `length` (длину) и `width` (ширину).
- Функция вычисляет площадь прямоугольника и возвращает её.
- В `main()` мы вызываем функцию, передаём ей длину и ширину и выводим результат.

---

## Типы данных и параметры функции

### Типы данных

Функции могут работать с различными типами данных: числами, строками, объектами и т.д. В C++ наиболее часто используемые типы данных:

- **int** — целые числа, например, 5, -10, 100.
- **float** — числа с плавающей запятой (дробные), например, 3.14, -0.5, 2.0.
- **char** — одиночные символы, например, 'a', '1', '@'.
- **string** — строки текста, например, "Hello", "C++".

### Передача параметров

Когда ты передаёшь данные функции, есть два способа передачи:

1. **По значению** — создаётся копия данных, и функция работает с этой копией.
2. **По ссылке** — функция может изменять исходные данные, потому что она работает с оригинальными значениями.

#### Пример передачи по значению:

```cpp
void changeValue(int x) {
    x = 10; // Меняем копию переменной x
}

int main() {
    int a = 5;
    changeValue(a);
    cout << "a = " << a << endl; // a не изменится, так как мы работали с копией
    return 0;
}
```

#### Пример передачи по ссылке:

```cpp
void changeValue(int &x) {
    x = 10; // Меняем оригинальное значение переменной x
}

int main() {
    int a = 5;
    changeValue(a);
    cout << "a = " << a << endl; // a изменится, так как мы работали с оригиналом
    return 0;
}
```

---

## Возвращаемые значения и void

### Функции с возвращаемым значением

Когда функция должна вернуть результат, мы используем ключевое слово `return`, чтобы вернуть значение в место вызова функции.

### Пример с возвращаемым значением:

```cpp
int sum(int a, int b) {
    return a + b; // Возвращаем сумму
}

int main() {
    int result = sum(5, 7); // Вызов функции и получение результата
    cout << "Сумма: " << result << endl;
    return 0;
}
```

### Функции без возвращаемого значения (void)

Если функция не должна ничего возвращать, мы используем тип `void`:

```cpp
void printMessage() {
    cout << "Привет, мир!" << endl;
}

int main() {
    printMessage(); // Вызов функции, которая не возвращает значения
    return 0;
}
```

---

## Рекурсивные функции

### Что такое рекурсия?

Рекурсия — это когда функция вызывает сама себя. Это может быть полезно для решения задач, которые могут быть разбиты на более мелкие похожие задачи. Однако нужно быть осторожным, чтобы не вызвать бесконечный цикл.

### Пример: факториал

Факториал числа — это произведение всех целых чисел от 1 до этого числа. Например, факториал 4 — это 4 * 3 * 2 * 1.

```cpp
int factorial(int n) {
    if (n <= 1) {
        return 1; // Базовый случай
    } else {
        return n * factorial(n - 1); // Рекурсивный вызов
    }
}

int main() {
    int num = 5;
    cout << "Факториал числа " << num << ": " << factorial(num) << endl;
    return 0;
}
```

---

## Функции и Raylib

Когда мы начинаем работать с графикой, например, с библиотекой Raylib, функции становятся ещё более полезными. В Raylib функции используются для выполнения различных задач, таких как создание окна, рисование объектов, обработка ввода и т.д.

Пример использования функции в Raylib:

```cpp
#include "raylib.h"

// Функция для рисования прямоугольника
void DrawRectangleOnScreen(Rectangle rect) {
    ClearBackground(RAYWHITE);  // Очищаем экран
    DrawRectangleRec(rect, BLUE);  // Рисуем прямоугольник
}

int main() {
    const int screenWidth = 800;
    const int screenHeight = 600;
    
    InitWindow(screenWidth, screenHeight, "Raylib Function Example");

    // Создаём прямоугольник
    Rectangle rect = { screenWidth / 2 - 50, screenHeight / 2 - 25, 100, 50 };
    
    while (!WindowShouldClose()) {
        // Обновляем экран
        BeginDrawing();
        DrawRectangleOnScreen(rect);  // Вызов функции для рисования
        EndDrawing();
    }

    CloseWindow();  // Закрываем окно Raylib
    return 0;
}
```

В этом примере мы создаём функцию `DrawRectangleOnScreen`, которая очищает экран и рисует прямоугольник. Функции в Raylib помогают структурировать код и упрощают повторное использование кода для различных задач, таких как рисование объектов или обработка ввода.
